jpnorair/OpenTag/include/board/cc13xx/launchpad_CC1310.h
/*  Copyright 2008-2022, JP Norair
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  *
  * 2. Redistributions in binary form must reproduce the above copyright 
  *    notice, this list of conditions and the following disclaimer in the 
  *    documentation and/or other materials provided with the distribution.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE 
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE 
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE 
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR 
  * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF 
  * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS 
  * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN 
  * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
  * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE 
  * POSSIBILITY OF SUCH DAMAGE.
  */
/**
  * @file       /board/cc13xx/launchpad_CC1310.h
  * @author     JP Norair
  * @version    R100
  * @date       29 Oct 2016
  * @brief      Board Configuration for TI CC1310 Launchpad
  * @ingroup    Platform
  *
  * Do not include this file, include /platform/config.h
  *
  * SPECIAL NOTE: search for "note BOARD Macro" lines in this file.  These
  * must be ported to other STM32L boards, because the OpenTag STM32L platform 
  * implementation depends on them.
  *
  ******************************************************************************
  */
  

#ifndef __launchpad_CC1310_H
#define __launchpad_CC1310_H

/// MCU definition for the board must be the first thing
#define __CC1310F128RGZ__

/// Controls whether you actually use the radio.
/// It is possible to test some systems just using a radio simulation in SRAM.
#define __USE_RADIO

#include <app/app_config.h>
#include <platform/hw/CC13xx_config.h>
#include <platform/interrupts.h>


#ifdef __USE_RADIO
#   ifdef __NULL_RADIO__
#       include <io/null_radio/config.h>
#   else
#       include <io/cc1310/config.h>
#   endif
#endif



/// Macro settings: ENABLED, DISABLED, NOT_AVAILABLE
#ifdef ENABLED
#   undef ENABLED
#endif
#define ENABLED  1

#ifdef DISABLED
#   undef DISABLED
#endif
#define DISABLED  0

#ifdef NOT_AVAILABLE
#   undef NOT_AVAILABLE
#endif
#define NOT_AVAILABLE   DISABLED




/** Additional RF Front End Parameters and Settings <BR>
  * ========================================================================<BR>
  * We assume you are using the included antenna and matching circuit, which 
  * has a 50% efficiency (-3dB) with 1dB insertion loss
  */
#ifdef __USE_RADIO
#   define RF_PARAM_BAND   866              //Can be 866 or 915
#   define RF_HDB_ATTEN    8                //Half dB attenuation (units = 0.5dB), used to scale TX power
#   define RF_HDB_RXATTEN  6
#   define RF_RSSI_OFFSET  RF_HDB_RXATTEN   //Offset applied to RSSI calculation
#endif



/** MCU Configuration settings      <BR>
  * ========================================================================<BR>
  * Implemented capability variants on this board/build
  */
#define MCU_CONFIG(VAL)                 MCU_CONFIG_##VAL   // FEATURE 
#define MCU_CONFIG_MULTISPEED           DISABLED                            // Automatic Clock Speed throttling
#define MCU_CONFIG_MAPEEPROM            NOT_AVAILABLE                       // CC13xx does not have built-in EEPROM
#define MCU_CONFIG_MPIPECDC             NOT_AVAILABLE                       // CC13xx does not have built-in USB
#define MCU_CONFIG_MPIPEUART            (MCU_CONFIG_MPIPECDC != ENABLED)    // UART MPipe Implementation
#define MCU_CONFIG_MPIPEI2C             DISABLED                            // I2C MPipe Implementation
#define MCU_CONFIG_MEMCPYDMA            ENABLED                             // MEMCPY DMA must be lowest priority of DMAs
#define MCU_CONFIG_USB                  (MCU_CONFIG_MPIPECDC == ENABLED)
#define MCU_CONFIG_VOLTLEVEL            0  // 2=Boost, 1=Normal, 0=Auto (Auto mode uses Normal voltage unless high power is selected in SW
#define MCU_CONFIG_CACHE                1  // 0=OFF, 1=ON, 2=Split




/** Platform Memory Configuration <BR>
  * ========================================================================<BR>
  * OpenTag needs to know where it can put Nonvolatile memory (file system) and
  * how much space it can allocate for filesystem.  
  *
  * On the CC13xx systems, the FS is stored in FLASH but typically all of the
  * files are mirrored in SRAM.  This is much more efficient than maintaining
  * files directly in Flash, especially on the CC1310 which has large flash
  * pages (4KB each).
  *
  * As Flash pages are 4KB, the size of the filesystem should be 4KB or 8KB.
  * 12KB is also possible, although this reduces RAM available to the system
  * to 8KB.  Often this is enough, but for advanced applications it may not be.
  * 
  * Default filesystem size is 8KB, which is more than enough.  If you set the
  * FS to 4 or 8 KB, it will be stored in the 4KB RAM sectors.  If you set it 
  * to 12KB, it will be stored in the 6KB RAM sectors.  These sectors will be
  * retained in low power modes.
  *
  * @note This configuration does not support A/B Firmware update features. 
  * Haystack's premium libraries for OpenTag support A/B Firmware updating.
  */

// You can comment-out these if you want to use chip defaults
#ifndef SRAM_AVAILABLE
#   define SRAM_AVAILABLE            (20*1024)
#endif
#ifndef EEPROM_AVAILABLE
#   define EEPROM_AVAILABLE          (0*1024)
#endif
#ifndef FLASH_AVAILABLE
#   define FLASH_AVAILABLE      (128*1024)
#endif
#ifndef EEPROM_SAVE_SIZE
#   define EEPROM_SAVE_SIZE     (0)
#endif

