jpnorair/OpenTag/include/board/cc13xx/launchpad_CC1310.h
// Using FLASH: FS is stored at the back of the flash.
#define FLASH_NUM_PAGES         (FLASH_SIZE / FLASH_PAGE_SIZE)      // FLASH_PAGE_SIZE comes platform/hw/...config.h
#define FLASH_FS_PAGES          2
#define FLASH_FS_FALLOWS        0
#define FLASH_FS_ALLOC          (FLASH_PAGE_SIZE * FLASH_FS_PAGES) 
#define FLASH_FS_ADDR           (FLASH_START_ADDR + FLASH_AVAILABLE - FLASH_FS_ALLOC)









/** Board-based Feature Settings <BR>
  * ========================================================================<BR>
  * 1. Buttons 1 and 2 are supported on DIO13 and DIO14 respectively
  * 
  * 2. Two LEDs are defined on DIO6 and DIO7.
  *    <LI> TRIG1 (Red LED) is on DIO6.  It typically indicates 
  *         that the radio is on and in RX mode.</LI>
  *    <LI> TRIG2 (Green LED) is on DIO7.  It typically indicates
  *         that the radio is on and in TX mode.</LI>
  *
  * 3. MPIPE can support UART TX/RX (no flow control) or I2C.  MPIPE supports
  *    a "break" mode, in both I2C and UART interfaces, where a break character 
  *    is transmitted by the client ahead of the packet in order to wakeup the 
  *    system.  This reduces power requirements.
  * 
  */
#define BOARD_FEATURE(VAL)              BOARD_FEATURE_##VAL
#define BOARD_PARAM(VAL)                BOARD_PARAM_##VAL

#define BOARD_FEATURE_MPIPE             ENABLED
#define BOARD_FEATURE_USBCONVERTER      BOARD_FEATURE_MPIPE         // Is UART connected via USB converter?
#define BOARD_FEATURE_MPIPE_BREAK       ENABLED                     // Send/receive leading break for wakeup

#define BOARD_FEATURE_LFXTAL            ENABLED                                 // LF XTAL used as Clock source
#define BOARD_FEATURE_HFXTAL            DISABLED                                // HF XTAL used as Clock source
#define BOARD_FEATURE_HFBYPASS          DISABLED                                // Use an externally driven oscillator
//#define BOARD_FEATURE_RFXTAL            DISABLED                                // XTAL for RF chipset
//#define BOARD_FEATURE_RFXTALOUT         DISABLED
#define BOARD_FEATURE_FULLSPEED         ENABLED                                 // 24 MHz
#define BOARD_FEATURE_FULLXTAL          DISABLED
#define BOARD_FEATURE_FLANKSPEED        (MCU_CONFIG_MULTISPEED == ENABLED)      // 48 MHz
#define BOARD_FEATURE_FLANKXTAL         DISABLED

#define BOARD_PARAM_TRIGS               2
#define BOARD_PARAM_LFHz                32768
#define BOARD_PARAM_LFtol               0.00002
#define BOARD_PARAM_HFHz                48000000
#define BOARD_PARAM_HFtol               0.02
#define BOARD_PARAM_HFppm               20000

// These are defined at FULL SPEED
#define BOARD_PARAM_AHBCLKDIV           1                       // AHB Clk = Main CLK / AHBCLKDIV
#define BOARD_PARAM_APB2CLKDIV          1                       // APB2 Clk = Main CLK / AHBCLKDIV
#define BOARD_PARAM_APB1CLKDIV          1                       // APB1 Clk = Main CLK / AHBCLKDIV

// JTAG and SWO Interfaces:
// TI puts TMS and TCKC on reserved pins, but TDO and TDI are muxed on DIO16 and DIO17
// Likewise, SWO is on DIO18.  Set this if you plan to use SWO.
#define BOARD_JTDO_PINNUM               16
#define BOARD_JTDO_PIN                  (1<<BOARD_JTDO_PINNUM)
#define BOARD_JTDI_PINNUM               17
#define BOARD_JTDI_PIN                  (1<<BOARD_JTDI_PINNUM)
#define BOARD_TRACESWO_PINNUM           18
#define BOARD_TRACESWO_PIN              0   //(1<<BOARD_TRACESWO_PINNUM)
#define BOARD_JTAG_PINS                 (BOARD_JTDO_PIN | BOARD_JTDI_PIN | BOARD_TRACESWO_PIN)

// SW1, SW2 are implemented on DIO12, DIO13 as active low.
#define BOARD_SW1_PINNUM                12
#define BOARD_SW1_PIN                   (1<<BOARD_SW1_PINNUM)
#define BOARD_SW1_POLARITY              0
#define BOARD_SW1_PULLING               0
#define BOARD_SW2_PINNUM                13
#define BOARD_SW2_PIN                   (1<<BOARD_SW2_PINNUM)
#define BOARD_SW2_POLARITY              0
#define BOARD_SW2_PULLING               0
#define BOARD_SW_PINS                   (BOARD_SW1_PIN | BOARD_SW2_PIN)

// LED interface is implemented on DIO7 and DIO8, which means you
// need to connect your own LEDS to these pins.
// "LEDO" is for "LED Orange" although TI uses a Red LED
#define BOARD_LEDG_PINNUM               7
#define BOARD_LEDG_PIN                  (1<<BOARD_LEDG_PINNUM)
#define BOARD_LEDG_POLARITY             1
#define BOARD_LEDO_PINNUM               8
#define BOARD_LEDO_PIN                  (1<<BOARD_LEDO_PINNUM)
#define BOARD_LEDO_POLARITY             1
#define BOARD_LED_PINS                  (BOARD_LEDG_PIN | BOARD_LEDO_PIN)

// TEST0, TEST1 pins are on DIO21, DIO22.
// They are not necessary, but Haystack uses them for manufacturing tests.
// For application purposes, these pins are available for any sort of usage.
#define BOARD_TEST0_PINNUM              21
#define BOARD_TEST0_PIN                 (1<<BOARD_TEST0_PINNUM)
#define BOARD_TEST0_POLARITY            0
#define BOARD_TEST0_PULLING             1
#define BOARD_TEST1_PINNUM              22
#define BOARD_TEST1_PIN                 (1<<BOARD_TEST1_PINNUM)
#define BOARD_TEST1_POLARITY            0
#define BOARD_TEST1_PULLING             1

// Main serial connections, used at least by MPIPE

// I2C on DIO4 & 5
#define BOARD_I2C_ID                    0
#define BOARD_I2C_SCLPINNUM             4
#define BOARD_I2C_SDAPINNUM             5
#define BOARD_I2C_SCLPIN                (1<<BOARD_I2C_SCLPINNUM)
#define BOARD_I2C_SDAPIN                (1<<BOARD_I2C_SDAPINNUM)
#define BOARD_I2C_PINS                  (BOARD_I2C_SCLPIN | BOARD_I2C_SDAPIN)

// UART on DIO2 & 3
#define BOARD_UART_ID                   0
#define BOARD_UART_TXPINNUM             3
#define BOARD_UART_RXPINNUM             2
#define BOARD_UART_TXPIN                (1<<BOARD_UART_TXPINNUM)
#define BOARD_UART_RXPIN                (1<<BOARD_UART_RXPINNUM)
#define BOARD_UART_PINS                 (BOARD_UART_TXPIN | BOARD_UART_RXPIN)

// ADC Analog inputs:
#define BOARD_ADC_PINS                  8
#define BOARD_ADC_0CHAN                 
#define BOARD_ADC_0PINNUM               23
#define BOARD_ADC_0PIN                  (1<<BOARD_ADC_0PINNUM)
#define BOARD_ADC_1CHAN                 
#define BOARD_ADC_1PINNUM               24
#define BOARD_ADC_1PIN                  (1<<BOARD_ADC_1PINNUM)
#define BOARD_ADC_2CHAN                 
#define BOARD_ADC_2PINNUM               25
#define BOARD_ADC_2PIN                  (1<<BOARD_ADC_2PINNUM)
#define BOARD_ADC_3CHAN                 
#define BOARD_ADC_3PINNUM               26
#define BOARD_ADC_3PIN                  (1<<BOARD_ADC_3PINNUM)
#define BOARD_ADC_4CHAN                 
#define BOARD_ADC_4PINNUM               27
#define BOARD_ADC_4PIN                  (1<<BOARD_ADC_4PINNUM)
#define BOARD_ADC_5CHAN                 
#define BOARD_ADC_5PINNUM               28
#define BOARD_ADC_5PIN                  (1<<BOARD_ADC_5PINNUM)
#define BOARD_ADC_6CHAN                 
#define BOARD_ADC_6PINNUM               29
#define BOARD_ADC_6PIN                  (1<<BOARD_ADC_6PINNUM)
#define BOARD_ADC_7CHAN                 
#define BOARD_ADC_7PINNUM               30
#define BOARD_ADC_7PIN                  (1<<BOARD_ADC_6PINNUM)
#define BOARD_ADC_PINS                  (BOARD_ADC_0PIN | BOARD_ADC_1PIN | BOARD_ADC_2PIN | BOARD_ADC_3PIN \
                                         BOARD_ADC_4PIN | BOARD_ADC_5PIN | BOARD_ADC_6PIN | BOARD_ADC_7PIN)


// Timer IO: 
// The Launchpad form factor only specifies a single PWM on DIO12.  Since OpenTag doesn't 
// use any PWM, it's not specified, and the application must deal with it.
// 
// OpenTag does, however, utilize Timer3 for certain internal purposes.  In particular,
// it uses TIM3B.  You can use TIM3A for your own purposes as long as you don't change
// the clocking or other global TIM3 control settings.
#define BOARD_TIMA_PORTNUM              1
#define BOARD_TIMA_PORT                 GPIOB
#define BOARD_TIMA_ID                   3
#define BOARD_TIMA                      TIM3
#define BOARD_TIMA_CHANS                2
#define BOARD_TIMA_1CHAN                1
#define BOARD_TIMA_2CHAN                2
#define BOARD_TIMA_1PINNUM              4
#define BOARD_TIMA_2PINNUM              5
#define BOARD_TIMA_1PIN                 (1<<BOARD_TIMA_1PINNUM)
#define BOARD_TIMA_2PIN                 (1<<BOARD_TIMA_2PINNUM)




/** BOARD Macros (most of them, anyway) <BR>
  * ========================================================================<BR>
  * BOARD Macros are required by the OpenTag CC13XX platform implementation.
  * We can assume certain things at the platform level, but not everything,
  * which is why BOARD Macros are required.
  *
  * If your board is implementing a radio (extremely likely), there are likely
  * some additional Board macros down near the radio configuration section.
  */

