jpnorair/OpenTag/include/board/cc13xx/launchpad_CC1310.h
    GPIOA->PUPDR    = (1 << (3*2)) \
                    | (1 << (13*2)) | (2 << (14*2));
    

#   ifndef __USE_RADIO
    GPIOA->AFR[0]   = (7 << (BOARD_UART_TXPINNUM*4)) \
                    | (7 << (BOARD_UART_RXPINNUM*4));
#   else
    GPIOA->AFR[0]   = (7 << (BOARD_UART_TXPINNUM*4)) \
                    | (7 << (BOARD_UART_RXPINNUM*4)) \
                    | (5 << ((BOARD_RFSPI_MOSIPINNUM)*4)) \
                    | (5 << ((BOARD_RFSPI_MISOPINNUM)*4)) \
                    | (5 << ((BOARD_RFSPI_SCLKPINNUM)*4));
#   endif

    
    GPIOA->AFR[1]   = (10 << ((BOARD_USB_DMPINNUM-8)*4)) \
                    | (10 << ((BOARD_USB_DPPINNUM-8)*4));

    /* */

    /// Configure Port B IO.
    /// Port B is used for external (module) IO.
    // - B0 is an Analog Input
    // - B1:2 are unused and set to Analog mode
    // - B3 is by default an input
    // - B4 is a PWM output, set to Analog until configured
    // - B5 is used as a radio input by default
    // - B6 is used as SPI-CS, an output
    // - B7 is unused and set to Analog mode
    // - B8:9 are setup for I2C bus: They start as output with Open Drain
    // - B10 is a PWM output, set to Analog until configured
    // - B11:15 are unused and set to Analog mode
    GPIOB->OTYPER   = (1 << (8)) | (1 << (9));
    GPIOB->BSRR     = (1 << (8)) | (1 << (9));

    GPIOB->MODER    = (GPIO_MODER_ANALOG << (0*2)) \
                    | (GPIO_MODER_ANALOG << (1*2)) \
                    | (GPIO_MODER_ANALOG << (2*2)) \
                    | (GPIO_MODER_IN     << (3*2)) \
                    | (GPIO_MODER_ANALOG << (4*2)) \
                    | (GPIO_MODER_IN     << (5*2)) \
                    | (GPIO_MODER_OUT    << (6*2)) \
                    | (GPIO_MODER_ANALOG << (7*2)) \
                    | (GPIO_MODER_OUT    << (8*2)) \
                    | (GPIO_MODER_OUT    << (9*2)) \
                    | (GPIO_MODER_ANALOG << (10*2)) \
                    | (GPIO_MODER_ANALOG << (11*2)) \
                    | (GPIO_MODER_ANALOG << (12*2)) \
                    | (GPIO_MODER_ANALOG << (13*2)) \
                    | (GPIO_MODER_ANALOG << (14*2)) \
                    | (GPIO_MODER_ANALOG << (15*2));
    
    GPIOB->OSPEEDR  = (GPIO_OSPEEDR_10MHz << (8*2)) \
                    | (GPIO_OSPEEDR_10MHz << (9*2));
    
    /// Configure Port C IO.
    /// Port C is used only for USB sense and 32kHz crystal driving
    // - C0:1 are analog inputs
    // - C2:6 are unused and set to analog
    // - C7 is the radio shutdown push-pull output
    // - C8:12 are unused and set to analog
    // - C13 is the user button, set to input HiZ
    // - C14:15 are 32kHz crystal driving, set to ALT
#   ifdef __USE_RADIO
    GPIOC->BSRR     = BOARD_RFCTL_SDNPIN;
#   endif

    GPIOC->MODER    = (GPIO_MODER_ANALOG << (0*2)) \
                    | (GPIO_MODER_ANALOG << (1*2)) \
                    | (GPIO_MODER_ANALOG << (2*2)) \
                    | (GPIO_MODER_ANALOG << (3*2)) \
                    | (GPIO_MODER_ANALOG << (4*2)) \
                    | (GPIO_MODER_ANALOG << (5*2)) \
                    | (GPIO_MODER_ANALOG << (6*2)) \
                    | (GPIO_MODER_OUT    << (7*2)) \
                    | (GPIO_MODER_ANALOG << (8*2)) \
                    | (GPIO_MODER_ANALOG << (9*2)) \
                    | (GPIO_MODER_ANALOG << (10*2)) \
                    | (GPIO_MODER_ANALOG << (11*2)) \
                    | (GPIO_MODER_ANALOG << (12*2)) \
                    | (GPIO_MODER_IN     << (13*2)) \
                    | (GPIO_MODER_OUT    << (14*2)) \
                    | (GPIO_MODER_ALT    << (15*2));
    
    /// Configure Port D I/O
    /// Port D is completely unused and set by default to Analog
    GPIOD->MODER    = 0xFFFFFFFF;
    
    // Assert Port H as HiZ
    GPIOH->MODER    = (GPIO_MODER_IN << (0*2))
                    | (GPIO_MODER_IN << (1*2));
    
    /// Configure Port H for Crystal Bypass
    /// By default it is set to HiZ input.  It is changed on-demand in FW
    
    // Disable GPIOC and GPIOH, they are never altered after this.
    RCC->IOPENR = _IOPENR_RUNTIME;
}





static inline void BOARD_RFSPI_CLKON(void) {
#ifdef __USE_RADIO
    BOARD_RFSPI_PORT->MODER &= ~((3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MOSIPINNUM*2)) );
    
    BOARD_RFSPI_PORT->MODER |= (GPIO_MODER_ALT << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (GPIO_MODER_ALT << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (GPIO_MODER_ALT << (BOARD_RFSPI_MOSIPINNUM*2));
    
  //BOARD_RFSPI_PORT->MODER ^= (3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (2 << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MOSIPINNUM*2));
#endif
}

static inline void BOARD_RFSPI_CLKOFF(void) {
#ifdef __USE_RADIO
    BOARD_RFSPI_PORT->MODER &= ~((3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MOSIPINNUM*2)) );
    
    BOARD_RFSPI_PORT->MODER |= (GPIO_MODER_OUT << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (GPIO_MODER_IN << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (GPIO_MODER_OUT << (BOARD_RFSPI_MOSIPINNUM*2));
    
  //BOARD_RFSPI_PORT->MODER ^= (3 << (BOARD_RFSPI_SCLKPINNUM*2)) \
                            | (2 << (BOARD_RFSPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_RFSPI_MOSIPINNUM*2));
#endif
}



#include <platform/timers.h>    // for systim_stop_clocker()
static inline void BOARD_STOP(ot_int code) {
/// code comes from sys_sig_powerdown, but it is usually 0-3.
/// For all STM32L devices, 3 is full-idle and 2 is radio-active-idle.  
/// Those are the only modes that should call this inline function.

    static const ot_u16 stop_flags[2] = {  
        (PWR_CR_LPSDSR | PWR_CR_CSBF), (PWR_CR_LPSDSR | PWR_CR_FWU | PWR_CR_ULP | PWR_CR_CSBF) };
        
    static const ot_u32 rcc_flags[2] = {
        (RCC_IOPENR_GPIOAEN | RCC_IOPENR_GPIOBEN), 0 };
        
    static const ot_u32 b_moder[2] = {
        0xFFFFFC0, 0xFFFFFFFF };
    
    ot_u16 scratch;
    
    code &= 1;
    
